analyzer:
	cargo fmt --all -- --check

format:
	cargo fmt --all

# cargo clippy --all-targets --all-features -- -D warnings
# เป็น linter สำหรับตรวจสอบโค้ด Rust เพื่อหาข้อผิดพลาด, โค้ดที่ไม่ดี, หรือส่วนที่สามารถปรับปรุงได้
# คำสั่งนี้ใช้เพื่อรัน Clippy อย่างเข้มงวด โดยตรวจสอบโค้ดทุกส่วนของโปรเจกต์ (ทุก target และทุก feature)
# และบังคับให้ไม่มีคำเตือนใด ๆ เกิดขึ้น (ถ้ามีคำเตือนจะทำให้ build ล้มเหลว) เหมาะสำหรับใช้ในโปรเจกต์ที่ต้องการรักษาคุณภาพโค้ดสูงสุด
# เช่น ใน CI/CD pipeline หรือก่อนปล่อยซอฟต์แวร์